Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ЦеныНоменкларуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменкларуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтавкиНДС/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТоварыНаименованиеПриИзменении(Элемент)
	СтрокаТаблицы = Элементы.Товары.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(СтрокаТаблицы.Наименование) Тогда
		Возврат;
	КонецЕсли;
	
	ЦенаИзРегистра = ПолучитьЦенуНоменклатурыНаСервере(СтрокаТаблицы.Наименование);
	Если ЦенаИзРегистра > 0 Тогда
		СтрокаТаблицы.Стоимость = ЦенаИзРегистра;
	КонецЕсли;
	
	ПересчитатьСтрокуТаблицы(СтрокаТаблицы);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	СтрокаТаблицы = Элементы.Товары.ТекущиеДанные;
	ПересчитатьСтрокуТаблицы(СтрокаТаблицы);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтоимостьПриИзменении(Элемент)
	СтрокаТаблицы = Элементы.Товары.ТекущиеДанные;
	ПересчитатьСтрокуТаблицы(СтрокаТаблицы);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	СтрокаТаблицы = Элементы.Товары.ТекущиеДанные;
	ПересчитатьСтрокуТаблицы(СтрокаТаблицы);
КонецПроцедуры

// СТРОГИЙ МАТЕМАТИЧЕСКИЙ БЛОК БЕЗ СКРЫТЫХ ОШИБОК
&НаКлиенте
Процедура ПересчитатьСтрокуТаблицы(СтрокаТаблицы)
	
	// 1. Считаем чистую Сумму (Количество * Стоимость)
	СтрокаТаблицы.Сумма = СтрокаТаблицы.Количество * СтрокаТаблицы.Стоимость;
	
	// 2. Определяем процент НДС из твоего перечисления
	ПроцентНДС = 0;
	Если СтрокаТаблицы.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20") Тогда
		ПроцентНДС = 20;
	ИначеЕсли СтрокаТаблицы.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10") Тогда
		ПроцентНДС = 10;
	ИначеЕсли СтрокаТаблицы.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС3") Тогда
		ПроцентНДС = 3;
	КонецЕсли;
	
	// 3. Записываем вычисленный налог в твой реальный реквизит СуммаСНДС
	СтрокаТаблицы.СуммаСНДС = Окр((СтрокаТаблицы.Сумма * ПроцентНДС) / 100, 2);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦенуНоменклатурыНаСервере(ВыбраннаяНоменклатура)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЦеныНоменкларуры.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменкларуры КАК ЦеныНоменкларуры
		|ГДЕ
		|	ЦеныНоменкларуры.Номенклатура = &Номенклатура";
		
	Запрос.УстановитьПараметр("Номенклатура", ВыбраннаяНоменклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Цена, 0);
КонецФункции
